docs: begin making a docs site with zensical
