--- a/docs/flows/backups.md
+++ b/docs/flows/backups.md
@@ -10,18 +10,29 @@ Restic.
 
+**Backups:**
+
+```mermaid
+flowchart LR
+    epvc(Application PVC)
+    rsrc(Volsync ReplicationSource)
+    s3(S3 Storage in UpCloud)
+
+    epvc-- backup -->rsrc
+    rsrc-- upload -->s3
 ```
-┌─────────────────┐          ┌─────────────────┐          ┌─────────────────┐
-│   Application   │          │    Volsync      │          │   S3 Storage    │
-│      PVC        │ ──────►  │  ReplicationSrc │ ──────►  │    (Upcloud)    │
-└─────────────────┘  backup  └─────────────────┘  upload  └─────────────────┘
-                                                                  │
-                     restore                                      │
-┌─────────────────┐          ┌─────────────────┐                  │
-│   New/Restored  │ ◄─────── │    Volsync      │ ◄────────────────┘
-│      PVC        │          │  ReplicationDst │     restore
-└─────────────────┘          └─────────────────┘
@@
 ```
+
 
 ## Components
